<template> 
   <div id="contain"> 
    <div class="title">
      象山港重点流域总氮环境容量及目标年所需削减量统计表
    </div>
       <el-table
    :data="tableData"
    height= "calc(100vh - 150px)"
    border
    style="width: 100%">
    <el-table-column
      prop="类别"
      label="类别"
      width="180">
    </el-table-column>
    <el-table-column
      prop="序号"
      label="序号"
      width="180">
    </el-table-column>
    <el-table-column
      prop="项目名称"
      label="项目名称">
    </el-table-column>
    <el-table-column
      prop="建设内容和标准"
      label="建设内容和标准">
    </el-table-column>
    <el-table-column
      prop="建设年限"
      label="建设年限">
    </el-table-column>
    <el-table-column
      prop="预期削减量（t）"
      label="预期削减量（t）">
    </el-table-column>
    <el-table-column
      prop="总投资（万元）"
      label="总投资（万元）">
    </el-table-column>
    <el-table-column
      prop="市级牵头部门"
      label="市级牵头部门">
    </el-table-column>
    <el-table-column
      prop="市级配合部门"
      label="市级配合部门">
    </el-table-column>
  </el-table>
  </div>

</template>

<script> 
export default {
  name: "nitrogen",
  computed: { 
  },
  data() { 
    return{ 
      tableData:[{"类别": "陆源污染治理\n", "序号": 1, "项目名称": "象山港重点流域河口地表水水质自动监测站建设", "建设内容和标准": "建立健全以自动监测为主、手工监测为辅的水环境监测体系；监测站拟配置常规五参数（pH、溶解氧、水温、电导率、浊度）、氨氮、总磷、总氮、高猛酸盐指数等9项监测指标", "建设年限": 2020, "预期削减量（t）": null, "总投资（万元）": 2800, "市级牵头部门": "市生态环境局", "市级配合部门": "市财政局、市住建局、市水利局、市农业农村局"}, {"类别": "陆源污染治理\n", "序号": 2, "项目名称": "涉水工业污染源整治", "建设内容和标准": "涉水工业污染源稳定达标排放，总氮标准参照《城镇污水处理厂污染物排放标准》（GB 18918-2002）一级A标准执行", "建设年限": "2020-2022", "预期削减量（t）": 11.5, "总投资（万元）": 2000, "市级牵头部门": "市生态环境局", "市级配合部门": "市发改委、市财政局、市住建局、市水利局"}, {"类别": "陆源污染治理\n", "序号": 3, "项目名称": "城镇污水厂提标改造（一期）", "建设内容和标准": "城镇污水厂达到地表水类IV类排放标准，总氮出水浓度在2019年的基础上稳步削减20%", "建设年限": "2020-2022", "预期削减量（t）": 66.8, "总投资（万元）": 1000, "市级牵头部门": "市水利局", "市级配合部门": "生态环境局、市住建局"}, {"类别": "陆源污染治理\n", "序号": 4, "项目名称": "城镇污水厂提标改造（二期）", "建设内容和标准": "总氮出水浓度在2019年的基础上稳步削减30%", "建设年限": "2023-2025", "预期削减量（t）": 33.4, "总投资（万元）": 1000, "市级牵头部门": "市水利局", "市级配合部门": "生态环境局、市住建局"}, {"类别": "陆源污染治理\n", "序号": 5, "项目名称": "配套污水管网建设工程", "建设内容和标准": "污水管网的建设、检查、维修和养护", "建设年限": "2020-2022", "预期削减量（t）": null, "总投资（万元）": 5000, "市级牵头部门": "市住建局、市水利局", "市级配合部门": null}, {"类别": "陆源污染治理\n", "序号": 6, "项目名称": "农村生活污水治理（一期）", "建设内容和标准": "实现农村生活污水治理行政村全覆盖、农村生活污水处理设施标准化运维全覆盖以及住户受益率达95%以上；出水标准力争达到《城镇污水处理厂污染物排放标准》（GB18918-2002）一级B排放标准", "建设年限": "2020-2022", "预期削减量（t）": 221.3, "总投资（万元）": 10000, "市级牵头部门": "市住建局、市农业农村局", "市级配合部门": "市水利局、市生态环境局、市综合执法局"}, {"类别": "陆源污染治理\n", "序号": 7, "项目名称": "农村生活污水治理（二期）", "建设内容和标准": "出水标准力争达到《城镇污水处理厂污染物排放标准》（GB18918-2002）一级A排放标准", "建设年限": "2023-2025", "预期削减量（t）": 87.9, "总投资（万元）": 15000, "市级牵头部门": "市住建局、市农业农村局", "市级配合部门": "市水利局、市生态环境局、市综合执法局"}, {"类别": "陆源污染治理\n", "序号": 8, "项目名称": "农业面源污染综合防治工程（一期）", "建设内容和标准": "测土配方施肥技术推广覆盖率达到85%以上，化肥、农药使用量在2019年的基础上，年削减率1%，秸秆综合利用率达到96%；生态沟渠等设施的覆盖面积在2019年的基础上，提升5%", "建设年限": "2020-2022", "预期削减量（t）": 54.5, "总投资（万元）": 500, "市级牵头部门": "市农业农村局", "市级配合部门": "市自然资源规划局、市生态环境局、市水利局"}, {"类别": "陆源污染治理\n", "序号": 9, "项目名称": "农业面源污染综合防治工程（二期）", "建设内容和标准": "测土配方施肥技术推广覆盖率达到90%以上，其中永久基本农田示范区测土配方施肥全覆盖，化肥、农药使用量在2019年的基础上，年削减率1%，秸秆全量化利用；生态沟渠等设施的覆盖面积在2019年的基础上，提升10%", "建设年限": "2023-2025", "预期削减量（t）": 113.4, "总投资（万元）": 700, "市级牵头部门": "市农业农村局", "市级配合部门": "市自然资源规划局、市生态环境局、市水利局"}, {"类别": "陆源污染治理\n", "序号": 10, "项目名称": "规模化畜禽养殖综合治理工程", "建设内容和标准": "规模化畜禽养殖场粪便、沼液综合利用率达到98%以上", "建设年限": "2020-2021", "预期削减量（t）": 80, "总投资（万元）": 1000, "市级牵头部门": "市农业农村局", "市级配合部门": "市自然资源规划局、市生态环境局"}, {"类别": "陆源污染治理\n", "序号": 11, "项目名称": "滨海湿地生态修复（一期）", "建设内容和标准": "下陈江、东塘河河口整治修复1250亩滨海湿地", "建设年限": "2020-2022", "预期削减量（t）": 50, "总投资（万元）": 12500, "市级牵头部门": "市自然资源规划局", "市级配合部门": "市发改委、市生态环境局、市水利局、市农业农村局"}, {"类别": "陆源污染治理\n", "序号": 12, "项目名称": "滨海湿地生态修复（二期）", "建设内容和标准": "莼湖溪、昆亭溪、颜公河、五市溪、峻壁溪河口整治修复3750亩滨海湿地", "建设年限": "2023-2025", "预期削减量（t）": 150, "总投资（万元）": 37500, "市级牵头部门": "市自然资源规划局", "市级配合部门": "市发改委、市生态环境局、市水利局、市农业农村局"}, {"类别": "海域污染治理\n", "序号": 1, "项目名称": "港口码头污染防治", "建设内容和标准": "沿海港口、码头、装卸站及船舶修造厂全面达到规范化建设要求，并开展鱼港环境综合整治", "建设年限": 2020, "预期削减量（t）": null, "总投资（万元）": 500, "市级牵头部门": "市交通局、市经信局、宁波海事局", "市级配合部门": "市发革委、市生态环境局、市水利局、市综合执法局"}, {"类别": "海域污染治理\n", "序号": 2, "项目名称": "船舶污染治理", "建设内容和标准": "对12米以上的渔业船舶安装油污分离器和生活污水处置装置", "建设年限": 2020, "预期削减量（t）": null, "总投资（万元）": 20, "市级牵头部门": "市交通局、宁波海事局", "市级配合部门": "市生态环境局、市农业农村局、市市场监管局、市综合执法局"}, {"类别": "海域污染治理\n", "序号": 3, "项目名称": "海洋垃圾污染防治", "建设内容和标准": "建立垃圾分类和“海上环卫”工作机制，实现入海河流和近岸海域垃圾的常态化防治", "建设年限": "长期", "预期削减量（t）": null, "总投资（万元）": 200, "市级牵头部门": "市生态环境局", "市级配合部门": "市交通局、市水利局、市农业农村局、市文广旅游局、市综合执法局、宁波海事局"}, {"类别": "海域污染治理\n", "序号": 4, "项目名称": "加强海洋生态红线管控", "建设内容和标准": "严格执行《浙江省海洋生态红线划定方案》，落实红线区管控措施，严守象山港海洋生态保护红线", "建设年限": "长期", "预期削减量（t）": null, "总投资（万元）": null, "市级牵头部门": "市自然资源规划局", "市级配合部门": null}, {"类别": "海域污染治理\n", "序号": 5, "项目名称": "象山港海域生态环境调查与健康评估", "建设内容和标准": "从水环境、生态等多个角度开展海湾生态环境综合摸底调查工作，对收集与调查的数据进行综合分析，实现象山港生态环境健康的综合评估", "建设年限": "2020-2022", "预期削减量（t）": null, "总投资（万元）": 300, "市级牵头部门": "市生态环境局", "市级配合部门": null}, {"类别": "海域污染治理\n", "序号": 6, "项目名称": "海水养殖容量研究", "建设内容和标准": "在铁港、黄墩港、西沪港等重点增养殖区开展海水养殖容量及合理养殖密度的研究", "建设年限": "2020-2022", "预期削减量（t）": null, "总投资（万元）": 50, "市级牵头部门": "市农业农村局", "市级配合部门": "市生态环境局"}, {"类别": "海域污染治理\n", "序号": 7, "项目名称": "大力整治海水养殖污染", "建设内容和标准": "围塘海水养殖尾水治理覆盖率达到100%；建立海水围塘养殖尾水治理示范场；尾水达标排放", "建设年限": "2020-2025", "预期削减量（t）": null, "总投资（万元）": 15000, "市级牵头部门": "市农业农村局", "市级配合部门": "市生态环境局、市自然资源规划局"}, {"类别": "海域污染治理\n", "序号": 8, "项目名称": "海洋水质自动监测网", "建设内容和标准": "建设象山港海域环境生态浮标系统", "建设年限": "2022-2025", "预期削减量（t）": null, "总投资（万元）": 500, "市级牵头部门": "市生态环境局", "市级配合部门": "市财政局、市住建局、市农业农村局"}, {"类别": "海域污染治理\n", "序号": 9, "项目名称": "生态养殖工程", "建设内容和标准": "建设水产养殖示范场、鱼贝藻生态养殖示范区等各类高效生态渔业示范区", "建设年限": "2022-2025", "预期削减量（t）": null, "总投资（万元）": 10000, "市级牵头部门": "市农业农村局", "市级配合部门": "市生态环境局、市财政局"}, {"类别": "海域污染治理\n", "序号": 10, "项目名称": "海域岸线综合整治与修复", "建设内容和标准": "结合象山港区域现状岸线资源特征和岸线规划，对象山港内使用率较低的港口码头进行合理规划调整，非法占用岸线进行整治，对破坏岸线进行保育；象山港自然岸线保有率保持在35%以上，沿海乡镇整治修复岸线新增5公里左右", "建设年限": "2022-2025", "预期削减量（t）": null, "总投资（万元）": 7000, "市级牵头部门": "市自然资源规划局", "市级配合部门": "市发改委、市财政局、市生态环境局、市交通局、市水利局、市农业农村局"}, {"类别": "海域污染治理\n", "序号": 11, "项目名称": "象山港区域大数据平台建设", "建设内容和标准": "系统平台将充分运用大数据、物联网、云计算、遥感监测、地理信息系统和移动通信网等现代化技术手段，以海湾保护管理为核心，围绕水资源保护、河流海湾水域岸线管理保护、水生态修复、执法监管等重点工作，打造多级联动的大数据管理信息系统，形成统一规范的河流海湾大数据仓库", "建设年限": "2025-2030", "预期削减量（t）": null, "总投资（万元）": 500, "市级牵头部门": "市生态环境局", "市级配合部门": null}]

    } 
  }, 
  created() {},
  mounted() { 
  },
  methods: { 
     objectSpanMethod({ row, column, rowIndex, columnIndex }) {
        if (columnIndex === 0) {
          if (rowIndex === 0) {
            return {
              rowspan: 12,
              colspan: 1
            };
          } else if (rowIndex === 12) {
            return {
              rowspan: 11,
              colspan: 1
            };
          }
        }
      }
    }
};
</script>

<style scoped  >   
  #contain{
    position: relative;
    width: 100%;
    height: 100%;
    /* background: url("../../assets/404.jpg");
    background-size: 100% 100%; */
    padding: 10px;
    overflow-y: auto;
  }
  .title{
    font-size: 30px;
    font-family: fantasy;
    margin: 10px;
    text-align: center;
  }
  .content{
    text-indent: 35px;
    font-size: 20px;
    font-family: fantasy;
    margin: 10px;
  }
  .img{
    text-align: center;
    width: 100%;
  }
  .picName{
    text-align: center;
    font-size: 20px;
    font-family: fantasy;
    margin: 10px;
  }
</style>
